In [2]:
import numpy as np
import pandas as pd

In [13]:
x=pd.read_csv('C:/Users/USER/Desktop/pandas/StudentsPerformance.csv')
x.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [14]:
x.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [15]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [16]:
x.shape

(1000, 8)

In [17]:
nans = x.shape[0] - x.dropna().shape[0]
print ("%d rows have missing values in the data" %nans)

0 rows have missing values in the data

In [18]:
x.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [26]:
cat = x.select_dtypes(include=['O'])
cat.apply(pd.Series.nunique)

gender                         2
race/ethnicity                 5
parental level of education    6
lunch                          2
test preparation course        2
dtype: int64

In [22]:
a = x[x.gender == 'male']
a.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
10,male,group C,associate's degree,standard,none,58,54,52

In [27]:
a.shape

(482, 8)

In [30]:

a[['race/ethnicity',
 'math score',
 'writing score',
 'reading score']].groupby(['race/ethnicity']).agg('median')

                math score  writing score  reading score
race/ethnicity
group A                 63             60             61
group B                 65             60             62
group C                 68             62             66
group D                 71             67             68
group E                 78             70             73

In [31]:
b = x[x.gender == 'female']
b.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [32]:

b[['race/ethnicity',
 'math score',
 'writing score',
 'reading score']].groupby(['race/ethnicity']).agg('median')

                math score  writing score  reading score
race/ethnicity
group A               57.0           67.0           67.5
group B               62.0           71.5           71.5
group C               63.0           74.0           73.0
group D               65.0           76.0           74.0
group E               71.0           76.0           76.0

In [34]:
x[['gender',
 'math score',
 'writing score',
 'reading score']].groupby(['gender']).agg ('median')

        math score  writing score  reading score
gender
female          65             74             73
male            69             64             66